Revit 2026 API

# WireMaterialTypeSetErase Method

---

Removes a specified wire material type from the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	WireMaterialType item
)
```
```vb
Public Overridable Function Erase (
	item As WireMaterialType
) As Integer
```
```cpp
public:
virtual int Erase(
	WireMaterialType^ item
)
```
```fsharp
abstract Erase :
        item : WireMaterialType -> int
override Erase :
        item : WireMaterialType -> int
```

#### Parameters

item WireMaterialType
    The wire material type to be erased.

#### Return Value

Int32The number of wire material types that were erased from the set.

#### Reference

WireMaterialTypeSet Class

Autodesk.Revit.DB.Electrical Namespace